//-----------------   Фильтр для оценки сигнала CO + C1*t  -------------------
   a0 =   2 * (  N * (2*N + 1) + 3 * Gamma * N) / ( N * (N + 1) * (N + 2) );
   a1 = - 2 * (2*N + 3*Gamma) / (N * (N + 1) );
   a2 =   2 * (  N + 3*Gamma) / (N * (N + 1) );
   a3 = - 2 * (  N - 1 + 3*Gamma) / ((N + 1) * (N + 2));


//-----------------   Фильтр для оценки сигнала C1   ----- из стгнала  CO + C1*t  -------------------

   pa0 =   6 / ( (N + 1) * (N + 2) * aT0);
   pa1 = - 6 / (N * (N + 1) * aT0);
   pa2 =   6 / (N * (N + 1) * aT0 );
   pa3 = - 6 / ( (N + 1) * (N + 2) * aT0);

   //----------   Фильтр для оценки сигнала CO + C1*t + C2*t^2   ---------------
   a[0]   =  Sigma0 + Sigma1*N + Sigma2*N*N;
   a[1]   = -2*Sigma0 - Sigma1*(2*N+1) - Sigma2*(2*N*N + 2*N - 1);
   a[2]   =  Sigma0 + Sigma1*(N+1)+ Sigma2*(N+1)*(N+1);
   a[N+1] =  - Sigma0 + Sigma1 - Sigma2;
   a[N+2] =  2*Sigma0 - Sigma1 - Sigma2;
   a[N+3] =  - Sigma0;

//-----------------   Фильтр для оценки сигнала C2   ---- из сигнала CO + C1*t + C2*t^2--------------------
   a[0]   =  30 / (aT0*aT0*(N+1)*(N+2)*(N+3));
   a[1]   = -60 / (aT0*aT0*N*(N+1)*(N+2));
   a[2]   =  30 / (aT0*aT0*N*(N-1)*(N+1));
   a[N+1] = -a[2];
   a[N+2] = -a[1];
   a[N+3] = -a[0];

//-----------------   Фильтр для оценки сигнала C1   ----- из стгнала  CO + C1*t + C2*t^2 -------------------
   a[0]   =  1 / (TFloat) (N + 1);
   a[1]   =  0;
   a[2]   =  0;
   a[N+1] = -1 / (TFloat) (N + 1);
   a[N+2] =  0;
   a[N+3] =  0;
