//---------------------------------------------------------------------------
#ifndef mpiInOutPointH
#define mpiInOutPointH
//---------------------------------------------------------------------------
#include <string>  // --- Строки ---
#include "mpiComplexMatrix.h"
//---------------------------------------------------------------------------
enum TPointType    {tInput, tOutput};
//---------------------------------------------------------------------------
//===========================================================================
//=======  TInOutPoint класс описывающий параметры входа или выхода елемента -----
//===========================================================================
class  TInOutPoint{
private:
      void              *fParentElement; // ---- Указакель на Родительский елемент --------
      int               *fCountInOutPointsOnElement; // ---- Указакель на Количество Входов и выходов -------
public:
   // ------------------------
      std::string        Caption;
      bool               Visible;
      bool               Conected;

      TPointType         Type;        // --- Вход или Выход елемента -----

      TComplexMatrix    *Queue;       // --- Очередь ---------

      int                xPos;        // --- Позиция Входа(выхода) елемента относительно координат Top, Left;
      int                yPos;        // --- Позиция Входа(выхода) елемента относительно координат Top, Left;

      bool              *EnableCalc;  // ---- Возможенли счет точки елемента -------
   // ------------------------
      void         **Elements;            // ----- (Как я понял) список едеметов по выходу ----------
      int            Elements_Count;      // ----- а это собственно их количество -------
   // ------------------------
      void          *CurrentLink;         // ----- эт к какому линку присоединен елемент --------
   // ------------------------
      void SetQueueSize  (int aQueueSize);
      void ClearPoints();
      void AddElement  (void *aElement);
      void Draw        ();
   // ------------------------
      TInOutPoint(void *aParentElement, int *aCountInOutPointsOnElement, std::string aCaption, TPointType aType);
     ~TInOutPoint();
   // ------------------------
};
//---------------------------------------------------------------------------
#endif
