#ifndef KFFH
#define KFFH
//**********************************
//    25 - 088
//**********************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора Амплитудного контура  -----
// DEBUG_MODE 2 ----- Настройка регулятора Кориолисового контура ---
// DEBUG_MODE 3 ----- Настройка регулятора Квадратурного контура -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE  0
#define COMPESATION 0  // 1/0 (on/off) 
#define PHASE_CORR  1  // 1/0 (on/off) 
// =====================
// =====================
#define T_base   11.88212927756       // ---- Базовый период колебаний, при комнатной температуре -----
#define N_comp   2.926993352509089    // ---- 6.3513523173502655944444444444444 ----
#define N_SPhase 6.593134
#define SPh_Base -0.9137748718

#define N_exc    0.0    // ---- 4.391507     // ---- Фаза автогенератора -----
#define X_ampl   2.0   // ---- Заданная амплитуда колебаний канала X ----

#define SYSTEM_PHASE 93.0           // ---- Амплитуда прыжка амплитудного  контура ----

#define Aa   0.100           // ---- Амплитуда прыжка амплитудного  контура ----
#define Ac   0.001 //0.0002 //0.001  // ---- Амплитуда прыжка кориолисового контура  ----
#define Aq   0.01  //0.0002 //0.01   // ---- Амплитуда прыжка Квадратурного контура  ----

#define k_omega -1.0   // ---- Знак угловой скорости ----
#define TIMES    35.0  // ---- Время прыжка
// ===================== 
// =====================

// *** Контур стабилизации амплитуды Амплитуды канала X ***   
	// --- Первый регулятор ---- 
	#define Kp_x1  18.0 //5hz
	#define Ki_x1   8.2
	// --- Второй регулятор ----
	#define Kp_x2 1.0
	#define Ki_x2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***  и
	// --- Первый регулятор ----
	#define Kp_c1 50.0  //20hz
	#define Ki_c1 35.0
	// --- Второй регулятор ----
	#define Kp_c2 1.0
	#define Ki_c2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_q1 38.0//10.0  //10hz
	#define Ki_q1 25.0//10.2
	// --- Второй регулятор ----
	#define Kp_q2 1.0
	#define Ki_q2 0.1
#endif



