#ifndef KFFH
#define KFFH

// *******************************
// **** Настройки Регуляторов ****
// *******************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора Амплитудного контура  -----
// DEBUG_MODE 2 ----- Настройка регулятора Кориолисового контура ---
// DEBUG_MODE 3 ----- Настройка регулятора Квадратурного контура -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE 0

// =====================
// =====================
#define N_exc   6.0  // ---- 4.391507     // ---- Фаза автогенератора -----
#define T_base  11.6274497609  // ---- Базовый период колебаний, при комнатной температуре ------
//#define N_comp  9.666511824    //6.3513523173502655944444444444444//
//#define N_phase 0.0

#define PHASE_EXC  34.020335665693013719352096005747
#define PHASE_COMP 33.4217

#define X_ampl    2.0   // ---- Заданная амплитуда колебаний канала X ----
#define k_omega  -1.0   // ---- Знак угловой скорости ----
#define TIMES    35.0  // ---- Время прыжка
// ===================== 
// =====================

// *** Контур PhAPCh ***
	// --- Первый регулятор ---- 
	#define Kp_f1 24.0 //5hz
	#define Ki_f1 33.2
	// --- Второй регулятор ----
	#define Kp_f2 1.0
	#define Ki_f2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала X ***
	// --- Первый регулятор ---- 
	#define Kp_x1  18.0 //5hz
	#define Ki_x1  11.2
	// --- Второй регулятор ----
	#define Kp_x2 1.0
	#define Ki_x2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***  и
	// --- Первый регулятор ----
	#define Kp_c1 50.0  //20hz
	#define Ki_c1 39.0
	// --- Второй регулятор ----
	#define Kp_c2 1.0
	#define Ki_c2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_q1 38.0//10.0  //10hz
	#define Ki_q1 27.0//10.2
	// --- Второй регулятор ----
	#define Kp_q2 1.0
	#define Ki_q2 0.1
#endif



