/**********************************************
 *               Гироскоп № 25-275            *
 *      Резонансная частота                   *
 *              Дата настройки                *
 **********************************************/ 
 
#include <def21364.h> 
#define NSHARC 0//номер контроллера
#define NGYRO 1//количество гироскопов


#define FILENAME2 "FIR_P_4325_94_100.dat";   // ----- Имя файла полосового фильтра
#define TAPSS 94   // ----- длина полосового фильтра

// *** Контур стабилизации амплитуды пучности ***
	// --- Первый регулятор ----
	#define KP21 18.5 //160.0 50hz//70.0 20Hz//22.0  5 Hz
	#define KI21  2.0 // 25.0     //12.0     // 3.0
	// --- Второй регулятор ----
	#define KP22 1.0
	#define KI22 0.1//0.1   

// *** Контур компенсации кориолисовой составляющей ***
	// --- Первый регулятор ----
	#define KP31  140.0 //250.0 100hz //140.0 50Hz
	#define KI31   14.0 // 52.0       // 40.0
	// --- Второй регулятор ----
	#define KP32 1.0
	#define KI32 0.1//

// *** Контур компенсации квадратурной составляющей ***
	// --- Первый регулятор ----
	#define KP41  48.0 //250.0 100hz//170.0 60Hz//120.0 50Hz //110.0 40Hz//50.0  20Hz//19.0 5Hz
	#define KI41  10.5 // 28.0      // 15.0     //  12.5     //13.0      // 7.5      // 3.0
	// --- Второй регулятор ----
	#define KP42 1.0
	#define KI42 0.1//0.07

// =====================
// =====================
#define flg_2 0   // ---- Настройка Контура стабилизации амплитуды пучности
#define flg_3 0   // ---- Настройка Контура компенсации кориолисовой составляющей
#define flg_4 0   // ---- Настройка компенсации квадратурной составляющей
#define flg_5 0   // ---- АЧХ возбуждения (фаза возбуждения)
#define flg_8 1   // ---- 0 = откл.контура компенсации 

// =====================
// =====================
#define N_exc    13.666145039//23.29//15.473//21.615
#define N_comp   6.751468866//13.83345062//9.385425621//13.29
#define T_base   23.08612633//37.0507125854
//#define K_angle1 0.25
//#define K_angle2 0.25

// ==========================================
// ==========================================
#define k_omega -1.0   // ---- Знак угловой скорости ----
#define SMM2    -1.9   // ---- Заданная амплитуда пучности ----

#define coef_Cc  0.0
#define coef_Cq  0.0

#define TIMES  4500000 // 45 sec // --- Время прыжка равное Times*1e-5 
		
//КОРРЕКЦИЯ НУЛЯ
#define flg_6 0

#define NN0   0.009222856394994
#define AA11  0.000870942417139
#define AA12  0.000062995523022
#define AA13 -0.000008745010325
#define AA14  0.0
#define AA15  0.0
#define AA16  0.0

#define AA21 -0.723775946004020
#define AA22 2.320329903031938
#define AA23 -1.882272363731656
#define AA24  0.0
#define AA25  0.0
#define AA26  0.0

#define AA31 0.022692529645274
#define AA32 0.234121425985433
#define AA33 0.000793307022387
#define AA34  0.0
#define AA35  0.0
#define AA36  0.0

#define AA41 0.000039030695657
#define AA42 -0.000000689973120
#define AA43 -0.000000001605869
#define AA44  0.0
#define AA45  0.0
#define AA46  0.0

// КОРРЕКЦИЯ МАСШТАБНОГО КОЭФФИЦИЕНТА
#define flg_7   0
#define flg_7_1 0 //0 - по частоте;  1 - по температуре

#define KM0   23.15 
#define KM1	 -20.02106908979//коэффициент квадрата разности частот
#define KM2  -43.01967029743//коэффициент разности частот
#define KM3	 47895.13773845051//cмещение
#define KM4	 47300.0//числитель

// ALFAq
#define flg_9 0

#define PD0   23.15 //период
#define KKA1	 -76.4157244858//коэффициент  разности частот
#define KKA2  1280.0667634231//коэффициент квадрата разности частот
#define KKA3	 32701.7995876094//коэффициент куба разности частот
#define KKA4	 37000.0//смещение

