#ifndef KFFH
#define KFFH
//**********************************
//    25 - 088
//**********************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора Амплитудного контура  -----
// DEBUG_MODE 2 ----- Настройка регулятора Кориолисового контура ---
// DEBUG_MODE 3 ----- Настройка регулятора Квадратурного контура -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE  0
#define COMPESATION 0  // 1/0 (on/off) 
//#define PHASE_CORR  1  // 1/0 (on/off) 
// =====================
// =====================

////////////////////////////////////////////////
#define Base_Frequency 4207.5274038462
#define X_Phase_algo   158.284
//#define Y_Phase_algo   68.30552 // -8.17781
#define Y_Phase_algo   60.12771


//165.61809450549398381649213098062
//163.41157387587669490308971340066
////////////////////////////////////////////////

#define X_ampl   1.0   // ---- Заданная амплитуда колебаний канала X ----

#define Aa   0.100           // ---- Амплитуда прыжка амплитудного  контура ----
#define Ac   0.001 //0.0002 //0.001  // ---- Амплитуда прыжка кориолисового контура  ----
#define Aq   0.01  //0.0002 //0.01   // ---- Амплитуда прыжка Квадратурного контура  ----

#define k_omega -1.0   // ---- Знак угловой скорости ----
#define TIMES    35.0  // ---- Время прыжка
// ===================== 
// =====================

// *** Контур стабилизации амплитуды Амплитуды канала X ***   
	// --- Первый регулятор ---- 
	#define Kp_x1  20.0 //5hz
	#define Ki_x1   8.2
	// --- Второй регулятор ----
	#define Kp_x2 1.0
	#define Ki_x2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***  и
	// --- Первый регулятор ----
	#define Kp_c1 50.0  //20hz
	#define Ki_c1 35.0
	// --- Второй регулятор ----
	#define Kp_c2 1.0
	#define Ki_c2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_q1 38.0//10.0  //10hz
	#define Ki_q1 25.0//10.2
	// --- Второй регулятор ----
	#define Kp_q2 1.0
	#define Ki_q2 0.1
#endif



