#ifndef KFFH
#define KFFH
//**********************************
//    43 - 239
//**********************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора Амплитудного контура  -----
// DEBUG_MODE 2 ----- Настройка регулятора Кориолисового контура ---
// DEBUG_MODE 3 ----- Настройка регулятора Квадратурного контура -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE  0
#define COMPESATION 1  // 1/0 (on/off) 
#define PHASE_CORR  1  // 1/0 (on/off) 

#define T_base   21.991     // ---- Базовый период колебаний, при комнатной температуре -----
#define N_comp   10.83      // ---- 6.3513523173502655944444444444444 ----
#define N_exc    0.25*T_base    // ---- 4.391507     // ---- Фаза автогенератора -----
#define N_SPhase 9.35224
#define SPh_Base -0.8870999236

#define X_ampl   1.5   // ---- Заданная амплитуда колебаний канала X ----

// =====================
// =====================
#define Aa   0.100           // ---- Амплитуда прыжка амплитудного  контура ----
#define Ac   0.001 //0.0002 //0.001  // ---- Амплитуда прыжка кориолисового контура  ----
#define Aq   0.01  //0.0002 //0.01   // ---- Амплитуда прыжка Квадратурного контура  ----

#define k_omega  -1.0   // ---- Знак угловой скорости ----
#define TIMES    35.0  // ---- Время прыжка
// ===================== 
// =====================

// *** Контур стабилизации амплитуды Амплитуды канала X ***
	// --- Первый регулятор ---- 
	#define Kp_x1  45.0 //5hz
	#define Ki_x1  21.2 
	// --- Второй регулятор ----
	#define Kp_x2 1.0
	#define Ki_x2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***  и
	// --- Первый регулятор ----
	#define Kp_c1 370.0  //20hz
	#define Ki_c1 190.0
	// --- Второй регулятор ----
	#define Kp_c2 1.0
	#define Ki_c2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_q1 93.0//10.0  //10hz
	#define Ki_q1 49.0//10.2
	// --- Второй регулятор ----
	#define Kp_q2 1.0
	#define Ki_q2 0.1
#endif



