//**********************************    25 - 435
#ifndef KFFH
#define KFFH

// *******************************
// **** Настройки Регуляторов ****
// *******************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора Амплитудного контура  -----
// DEBUG_MODE 2 ----- Настройка регулятора Кориолисового контура ---
// DEBUG_MODE 3 ----- Настройка регулятора Квадратурного контура -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE 0

// =====================
// =====================
#define N_exc   2.511454    // ---- 4.391507     // ---- Фаза автогенератора -----
#define N_comp  5.38460614    //6.3513523173502655944444444444444//
#define T_base  10.012690    // ---- Базовый период колебаний, при комнатной температуре ------

#define X_ampl   2.0   // ---- Заданная амплитуда колебаний канала X ----

#define Aa   0.100           // ---- Амплитуда прыжка амплитудного  контура ----
#define Ac   0.0002 //0.001  // ---- Амплитуда прыжка кориолисового контура  ----
#define Aq   0.0002 //0.01   // ---- Амплитуда прыжка Квадратурного контура  ----

#define k_omega -1.0   // ---- Знак угловой скорости ----
#define TIMES    35.0  // ---- Время прыжка
// -- xPhase 106.88
// ===================== 
// =====================

// *** Контур стабилизации амплитуды Амплитуды канала X ***
	// --- Первый регулятор ---- 
	#define Kp_x1  38.0 //5hz
	#define Ki_x1  18.2
	// --- Второй регулятор ----
	#define Kp_x2 1.0
	#define Ki_x2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***  и
	// --- Первый регулятор ----
	#define Kp_c1 9000.0  //20hz
	#define Ki_c1 3305.0
	// --- Второй регулятор ----
	#define Kp_c2 1.0
	#define Ki_c2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_q1 9000.0//10.0  //10hz
	#define Ki_q1 1325.0//10.2
	// --- Второй регулятор ----
	#define Kp_q2 1.0
	#define Ki_q2 0.1
#endif



