
/**********************************************
 *             Гироскоп № 330_2 ось (1-5)     *
 *   Резонансная частота - 4181 Hz; Q - 26109 *
 *         Дата настройки 12.02.09            *
 *			M = 0.03968  FIkom = 0.0042       *
 **********************************************/
 
#include <def21364.h> 

#define NSHARC 0 //номер контроллера
#define NGYRO  1 //количество гироскопов

#define FILENAME2 "FIR_P_4175_96_100.dat";   // ----- Имя файла полосового фильтра
#define TAPSS 96   // ----- длина полосового фильтра

// *** Контур стабилизации амплитуды пучности
	// --- Первый регулятор ----
#define KP21 25.0 //16.0  5 Hz
#define KI21  2.0 //2.0
	// --- Второй регулятор ----
#define KP22 1.0
#define KI22 0.1 //0.1   

// *** Контур компенсации кориолисовой составляющей
	// --- Первый регулятор ----
#define KP31  100.0 // 30Hz
#define KI31   18.0 //
// --- Второй регулятор ----
#define KP32 1.0
#define KI32 0.1 

// *** Контур компенсации квадратурной составляющей
	// --- Первый регулятор ----
#define KP41 50.0 //30.0  5 Hz
#define KI41  8.5 //10.0
	// --- Второй регулятор ----
#define KP42 1.0
#define KI42 0.1 //0.07

// =====================
// =====================
#define flg_2 0   // ---- Настройка Контура стабилизации амплитуды пучности
#define flg_3 0   // ---- Настройка Контура компенсации кориолисовой составляющей
#define flg_4 0   // ---- Настройка компенсации квадратурной составляющей
#define flg_5 0   // ---- АЧХ возбуждения (фаза возбуждения)

#define flg_8 1   // ---- 0 = откл.контура компенсации 

// =====================
// =====================
#define N_exc  18.81735
#define N_comp  8.853408659 //8
#define T_base 23.92697

// =====================
// =====================
#define k_omega   1.0   // ---- Знак угловой скорости ----
#define SMM2     -2.20  // ---- Заданная амплитуда пучности ----

#define coef_Cc  0.0
#define coef_Cq  0.0

#define TIMES  5000000 // 45 sec // --- Время прыжка равное Times*1e-5 
		
//КОРРЕКЦИЯ НУЛЯ
#define flg_6 0

#define NN0 0.009222856394994
#define AA11 0.000870942417139
#define AA12 0.000062995523022
#define AA13 -0.000008745010325
#define AA14  0.0
#define AA15  0.0
#define AA16  0.0

#define AA21 -0.723775946004020
#define AA22 2.320329903031938
#define AA23 -1.882272363731656
#define AA24  0.0
#define AA25  0.0
#define AA26  0.0

#define AA31 0.022692529645274
#define AA32 0.234121425985433
#define AA33 0.000793307022387
#define AA34  0.0
#define AA35  0.0
#define AA36  0.0

#define AA41 0.000039030695657
#define AA42 -0.000000689973120
#define AA43 -0.000000001605869
#define AA44  0.0
#define AA45  0.0
#define AA46  0.0

// КОРРЕКЦИЯ МАСШТАБНОГО КОЭФФИЦИЕНТА
#define flg_7 0
#define flg_7_1 1 //0 - по частоте;  1 - по температуре

#define KM0   23.15 
#define KM1	 -20.02106908979//коэффициент квадрата разности 
#define KM2  -43.01967029743//коэффициент разности 
#define KM3	 47895.13773845051//cмещение
#define KM4	 47300.0//числитель


// ALFAq
#define flg_9 0
#define PD0   23.15 //период
#define KKA1 -76.4157244858//коэффициент  разности частот
#define KKA2  1280.0667634231//коэффициент квадрата разности частот
#define KKA3  32701.7995876094//коэффициент куба разности частот
#define KKA4  37000.0//смещение

