#ifndef KFFH
#define KFFH
//**********************************
//    25 - 088
//**********************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора Амплитудного контура  -----
// DEBUG_MODE 2 ----- Настройка регулятора Кориолисового контура ---
// DEBUG_MODE 3 ----- Настройка регулятора Квадратурного контура -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE  0
#define COMPESATION 1  // 1/0 (on/off) 
// =====================
// =====================
#define T_base_x   9.8629263139       // ---- Базовый период колебаний, при комнатной температуре -----
#define N_exc_x    5.3666260    // ---- 4.391507     // ---- Фаза автогенератора -----
#define N_comp_x   7.9083226186607457    // ---- 6.3513523173502655944444444444444 ----

#define T_base_y   9.86898       // ---- Базовый период колебаний, при комнатной температуре -----
#define N_exc_y    5.4690    // ---- 4.391507     // ---- Фаза автогенератора -----
#define N_comp_y   7.9225294618183022   // ---- 6.3513523173502655944444444444444 ----

#define X_ampl   1.0   // ---- Заданная амплитуда колебаний канала X ----

#define Aa   0.100           // ---- Амплитуда прыжка амплитудного  контура ----
#define Ac   0.001 //0.0002 //0.001  // ---- Амплитуда прыжка кориолисового контура  ----
#define Aq   0.01  //0.0002 //0.01   // ---- Амплитуда прыжка Квадратурного контура  ----

#define k_omega -1.0   // ---- Знак угловой скорости ----
#define TIMES    35.0  // ---- Время прыжка
// ===================== 
// =====================
// *** Контур стабилизации амплитуды Амплитуды канала X ***   
	// --- Первый регулятор ---- 
	#define Kp_x1  18.0 //5hz
	#define Ki_x1  18.2
	// --- Второй регулятор ----
	#define Kp_x2 1.0
	#define Ki_x2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***  и
	// --- Первый регулятор ----
	#define Kp_c1 50.0  //20hz
	#define Ki_c1 45.0
	// --- Второй регулятор ----
	#define Kp_c2 1.0
	#define Ki_c2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_q1 38.0//10.0  //10hzz
	#define Ki_q1 45.0//10.2
	// --- Второй регулятор ----
	#define Kp_q2 1.0
	#define Ki_q2 0.1
#endif



