#ifndef KFFH
#define KFFH

// *******************************
// **** Настройки Регуляторов ****
// *******************************
// DEBUG_MODE 0 ----- Базовый режим работы -------
// DEBUG_MODE 1 ----- Настройка регулятора канала X -----
// DEBUG_MODE 2 ----- Настройка регулятора канала Y -----
// DEBUG_MODE 3 ----- Настройка регулятора разночастотности канала Y -----
// DEBUG_MODE 7 ----- АЧХ возбуждения (фаза возбуждения) -----
#define DEBUG_MODE 0

// =====================
// =====================
#define N_exc_x          14.6909  // 4.391507     // ---- Фаза автогенератора -----
#define N_exc_y          14.6909  // 4.42788076   // ---- Фаза автогенератора -----
#define N_SystemPhase_x  -14.4953927237 // ---- 
#define N_SystemPhase_y  -14.4179562256 // ---- 

#define T_base 22.658912774916141302958461181974 // ---- Базовый период колебаний, при комнатной температуре ------
               
//#define N_exc  4.07  // ---- Фаза автогенератора -----
//#define T_base 8.4489     // ---- Базовый период колебаний, при комнатной температуре ------

#define X_ampl   1.8      // ---- Заданная амплитуда колебаний канала X ----
#define Y_ampl   1.8      // ---- Заданная амплитуда колебаний канала Y ----

#define k_omega  1.0      // ---- Знак угловой скорости ----
#define TIMES    25*50000 // ---- Время прыжка

// =====================
// =====================

// *** Контур стабилизации амплитуды Амплитуды канала X ***
	// --- Первый регулятор ---- 
	#define Kp_X1 6.5
	#define Ki_X1 2.2
	// --- Второй регулятор ----
	#define Kp_X2 1.0
	#define Ki_X2 0.1

// *** Контур стабилизации амплитуды Амплитуды канала Y ***
	// --- Первый регулятор ----
	#define Kp_Y1 6.5  //5hz
	#define Ki_Y1 2.2
	// --- Второй регулятор ----
	#define Kp_Y2 1.0
	#define Ki_Y2 0.1

// *** Контур стабилизации Разночастотности **
	// --- Первый регулятор ----
	#define Kp_F1 22.0//10.0  //10
	#define Ki_F1  9.0//10.2
	// --- Второй регулятор ----
	#define Kp_F2 1.0
	#define Ki_F2 0.1

#endif


