#ifndef _CONSOLELIB__H_
#define _CONSOLELIB__H_

typedef void* ConsoleHandle;

//----------------------------------------------------------------
// console_Create
//----------------------------------------------------------------
// DESCRIPTION: Создает консольное окно для приложение Windows
//              либо перехватытвает управление для обычного
//              консольного приложения
//----------------------------------------------------------------
ConsoleHandle console_Create(const char* title, int top, int left, int width, int height, bool maxSize);

//----------------------------------------------------------------
// console_Free
//----------------------------------------------------------------
// DESCRIPTION: Удалить консольное окно
//----------------------------------------------------------------
void console_Free(ConsoleHandle console);

//----------------------------------------------------------------
// console_GetMaxFontsCount
//----------------------------------------------------------------
// DESCRIPTION: Определить максимальное количество шрифтов,
//              доступных консольному окну
//----------------------------------------------------------------
int console_GetMaxFontsCount(ConsoleHandle handle);

//----------------------------------------------------------------
// console_GetCurrentFont
//----------------------------------------------------------------
// DESCRIPTION: Определить текущий шрифт для консольного окна
//----------------------------------------------------------------
int console_GetCurrentFont(ConsoleHandle handle);

//----------------------------------------------------------------
// console_SetFont
//----------------------------------------------------------------
// DESCRIPTION: Установить текущий шрифт
//----------------------------------------------------------------
bool console_SetFont(ConsoleHandle handle, int font);

//----------------------------------------------------------------
// console_ToMaxSize
//----------------------------------------------------------------
// DESCRIPTION: Установить размеры консольного окна, чтобы оно
//              занимало весь экран при текущем шрифте
//----------------------------------------------------------------
bool console_ToMaxSize(ConsoleHandle handle);

//----------------------------------------------------------------
// console_SetTextColor
//----------------------------------------------------------------
// DESCRIPTION: Установить цвет текста
//----------------------------------------------------------------
bool console_SetTextColor(ConsoleHandle handle, int red, int green, int blue, int intensity);

//----------------------------------------------------------------
// console_SetBackgroundColor
//----------------------------------------------------------------
// DESCRIPTION: Установить цвет фона
//----------------------------------------------------------------
bool console_SetBackgroundColor(ConsoleHandle handle, int red, int green, int blue, int intensity);

//----------------------------------------------------------------
// console_Resize
//----------------------------------------------------------------
// DESCRIPTION: Установить новые размеры консольного окна
//----------------------------------------------------------------
bool console_Resize(ConsoleHandle handle, int width, int height);

//----------------------------------------------------------------
// console_GetWidth
//----------------------------------------------------------------
// DESCRIPTION: Получить ширину текущего консольного окна
//----------------------------------------------------------------
int console_GetWidth(ConsoleHandle handle);

//----------------------------------------------------------------
// console_GetHeight
//----------------------------------------------------------------
// DESCRIPTION: Получить высоту текущего консольного окна
//----------------------------------------------------------------
int console_GetHeight(ConsoleHandle handle);

//----------------------------------------------------------------
// console_SetTitle
//----------------------------------------------------------------
// DESCRIPTION: Установить заголовок консоли
//----------------------------------------------------------------
bool console_SetTitle(ConsoleHandle handle, const char* title);

//----------------------------------------------------------------
bool console_Print(ConsoleHandle handle, const char* msg, ...);
bool console_Scan(ConsoleHandle handle, const char* msg, ...);

void console_GetClassName(ConsoleHandle handle, char* name);

#endif