//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit_Language.h"

//---------------------------------------------------------------------------

#pragma package(smart_init)
// 31
TLanguageType LanguageType = ltRussian;
AnsiString    LanguageString[114][2] = {
                                      {"   Файл   "                                 , "   File   "    }, // --- 0
                                      {"   Установки   "                            , "   Options   " }, // --- 1
                                      {"   О программе ..."                         , "   About ..."  }, // --- 2
                                      {"  Выход "                                   , " Exit "        }, // --- 3
                                      {"Расчет зон видимости (статика)"             , "Calc detection zones (statics)" }, // --- 4
                                      {"Запуск статического режима"                 , "Run in static mode" }, // --- 5
                                      {"Экстраполяция данных"                       , "Data extrapolation" }, // --- 6
                                      {"Угломестные линии"                          , "Elevation lines" }, // --- 7
                                      {"Расчет зон видимости (динамика)"            , "Calc detection zones (dynamics)" }, // --- 8
                                      {"Запуск динамического режима"                , "Run in dynamic mode" }, // --- 9
                                      {"Стоп"                                       , "Stop" }, // --- 10
                                      {"Остановить моделирование"                   , "Stop model" }, // --- 11
                                      {"Сохранить изображение"                      , "Save image" }, // --- 12
                                      {"Удалить рисунок"                            , "Delete image" }, // --- 13
                                      {"Переименовать рисунок ..."                  , "Rename image" }, // --- 14
                                      {"Востановить параметры по умолчанию"         , "Restore default settings" }, // --- 15
                                      {"РЛС"                                        , "Radar" }, // --- 16
                                      {"Параметры РЛС"                              , "Radar features" }, // --- 17
                                      {"Отображение"                                , "Display" }, // --- 18
                                      {"Параметры отображения"                      , "Display parameters" }, // --- 19
                                      {"Cреда распространения"                      , "Propagation medium" }, // --- 20
                                      {"Х-ки обнаружения"                           , "Detection perf" }, // --- 21 //Characteristics
                                      {"Цель"                                       , "Target" }, // --- 22
                                      {"Параметры цели"                             , "Target parameters" }, // --- 23
                                      {"Загрузить параметры"                        , "Load parameters" }, // --- 24
                                      {"Сохранить параметры"                        , "Save parameters" }, // --- 25
                                      {"Выход ..."                                  , "Exit ..." }, // --- 26
                                      {"Перечень зон видимости:"                    , "List of detection zones:" }, // --- 27
                                      {"Высота антенны"                             , "Antenna height" }, // --- 28
                                      {"Угол места луча ДН"                         , "Elevation beamwidth" }, // --- 29
                                      {"Ширина луча ДН в ВП"                        , "VP beamwidth" }, // --- 30
                                      {"Длина волны"                                , "Wavelength" }, // --- 31
                                      {"Форма ДНА"                                  , "Antenna pattern (AP)" }, // --- 32
                                      {"Максимальная дальность"                     , "M       ax Range" }, // --- 33
                                      {"Расчет стандартной дальности"                   , "Calc range (S/N = 1)" }, // --- 34
                                      {"Импульсная мощность"                        , "Peak power" }, // --- 35
                                      {"К-т ДНА на передачу"                        , "Antenna gain (Tr)" }, // --- 36
                                      {"К-т ДНА на прием"                           , "Antenna gain (Rr)" }, // --- 37
                                      {"К-т сжатия на приемнике"                    , "Factor compression" }, // --- 38
                                      {"К-т шума приемника"                         , "Noise factor" }, // --- 39
                                      {"Полоса пропускания приемника"               , "Receiver passband" }, // --- 40
                                      {"Полоса пр. приемника"                       , "Receiver passband" }, // --- 41
                                      {"Потери при излучении"                       , "Transmitting loss factor" }, // --- 42
                                      {"Потери при приеме"                          , "Receiving loss factor" }, // --- 43
                                      {"Потери при обработке"                       , "Processing loss" }, // --- 44
                                      {"дБ"                                         , "dB" }, // --- 45
                                      {"МГц"                                        , "MHz" }, // --- 46
                                      {"кВт"                                        , "kW" }, // --- 47
                                      {"км"                                         , "km" }, // --- 48
                                      {"c"                                          , "s" }, // --- 49
                                      {"cм"                                         , "sm" }, // --- 50
                                      {"гр"                                         , "deg" }, // --- 51
                                      {"м"                                          , "m" }, // --- 52
                                      {"Гц"                                         , "Hz" }, // --- 53
                                      {"ЭПР цели"                                   , "Target CS" }, // --- 54
                                      {"Модель флюктуации сигнала"                  , "Model of signal fluctuation" }, // --- 55
                                      {"Без флюктуаций"                             , "No fluctuation" }, // --- 56
                                      {"Сверлинг 1"                                 , "Swerling 1" }, // --- 57
                                      {"Сверлинг 3"                                 , "Swerling 3" }, // --- 58
                                      {"Сверлинг 2"                                 , "Swerling 2" }, // --- 59
                                      {"Сверлинг 4"                                 , "Swerling 4" }, // --- 60
                                      {"Автомат. расчет высоты отображения"         , "Auto display height" }, // --- 61
                                      {"Высота отображения"                         , "Display height" }, // --- 62
                                      {"Цена деления вертикал. оси"                 , "Vertical axis tick spacing" }, // --- 63
                                      {"Автомат. расчет горизонт. дальности"        , "Auto horizontal range" }, // --- 64
                                      {"Горизонтальная дальность"                   , "Horizontal range" }, // --- 65
                                      {"Цена деления горизонт. оси"                 , "Horizontal axis tick spacing" }, // --- 66
                                      {"Цвет фона экрана"                           , "Background color" }, // --- 67
                                      {"Цвет осевых линий"                          , "Axis line color" }, // --- 68
                                      {"Цвет пунктирных линий"                      , "Dot line color" }, // --- 69
                                      {"Цвет шрифтов"                               , "Font color" }, // --- 70
                                      {"Установки угломестной оси"                  , "Elevation axis settings" }, // --- 71
                                      {"Высота неровности"                          , "Asperity height" }, // --- 72
                                      {"Бальность моря"                             , "Sea state, numbers" }, // --- 73
                                      {"Коэф. двусторонних потерь в атмосфере"      , "Atmospheric-absorption loss" }, // --- 74
                                      {"Коэф. прочих потерь"                        , "Other loss factor" }, // --- 75
                                      {"Эффективный радиус Земли"                   , "Effective Earth radius" }, // --- 76
                                      {"Волнение моря"                              , "Sea disturbance" }, // --- 77
                                      {"Амплитуда"                                  , "Amplitude" }, // --- 78
                                      {"Частота"                                    , "Frequency" }, // --- 79
                                      {"Фаза"                                       , "Phase" }, // --- 80
                                      {"Вероятность обнаружения"                    , "Probability of detection" }, // --- 81
                                      {"Вероятность ложных тревог"                  , "False alarm probability" }, // --- 82
                                      {"Зоны видимости для других Pd"               , "Detection zones for other Pd" }, // --- 83
                                      {"Установки угломестной оси"                  , "Elevation axis settings" }, // --- 84
                                      {"Перечень угломестных отметок"               , "List of elevation marks" }, // --- 85
                                      {"Отмена"                                     , "Cancel" }, // --- 86
                                      {"Да"                                         , "Yes" }, // --- 87
                                      {"Значение угла"                              , "Angle value" }, // --- 88
                                      {"Показывать отметку"                         , "Show mark " }, // --- 89
                                      {"Применить"                                  , "Apply" }, // --- 90
                                      {"Отмена"                                     , "Cancel" }, // --- 91
                                      {"  Удалить отметку"                          , "Delete mark" }, // --- 92
                                      {"  Добавить отметку"                         , "Add mark" }, // --- 93
                                      {"Таблица"                                    , "Table" }, // --- 94
                                      {"Сохранить таблицу в файл"                   , "Save table in a file" }, // --- 95
                                      {"Высота цели"                                , "Target altitude" }, // --- 96
                                      {"Дальность"                                  , "Range" }, // --- 97
                                      {"НИИ 'Квант-Радиолокация'"                   , "SRI 'Kvant Radar System'"}, // -----98
                                      {"Версия 2.0"                                 , "Version 2.0"}, // -----99
                                      {"© НПП 'Цифровие системи и технологии'"      , "© Digital systems and technologies"}, // -----100
                                      {"НПП 'Цифровые системи и технологии'"        , "Digital systems and technologies"}, // -----101
                                      {"Алгоритмы программы :"                      , "Program algorithms :"}, // -----102
                                      {"Интерфейс программы :"                      , "Program interface :"}, // -----103
                                      {"Файлы параметров зoн видимости (*.zv)|*.zv" , " File parametrs (*.zv)|*.zv"}, // -----104
                                      {"Открыть файл параметров зoн видимости"      , " Open file"}, // -----105
                                      {"Файлы параметров зoн видимости (*.zv)|*.zv" , " File paramatrs (*.zv)|*.zv"}, // -----106
                                      {"Сохранить файл параметров зoн видимости"    , " Save file"}, // -----107
                                      {"Автомат. расчет кол.импульсов"              , " Auto impuls count"}, // -----108
                                      {"Количество импульсов"                       , " Impuls count"}, // -----109
                                      {"Нормирующий множитель"                      , "Normalizing factor"}, // -----110
                                      {"Ширина луча ДН в ГП"                        , "HP beamwidth" }, // --- 111
                                      {"Частота след. импульсов"                    , "PRF" }, // --- 112
                                      {"Коэффициент различимости"                   , "Coefficient of discrimination" }, // --- 113
                                     };

